//-------------------------------------------------------------------//
// чтение регистра из EEPROM
//-------------------------------------------------------------------//
float read_reg(char a)
        {
        float k_f;
        ee_float=&(reg[a]);
        k_f=*ee_float;
        if ((k_f>MAX_MIN[a,1])||(k_f<MAX_MIN[a,0])) k_f=FAKTORY[a];//проверка граничных значений
        return k_f;
        }
//-------------------------------------------------------------------//
// запись регистра в EEPROM
//-------------------------------------------------------------------//
void save_reg(float a,int b)
        {
        eeprom float *ee_float;
        ee_float=b;
        *ee_float=a;
        }
//-------------------------------------------------------------------//
// повтор нажатия кнопки
//-------------------------------------------------------------------//
void rekey()
        {
        if (count_key2>20){if (++count_key1>103) count_key1=102;} 
        else if (count_key1>100){if (++count_key1>106) {count_key1=102;count_key2++;}}
        else if (((sys_time-time_key)>50)&&(count_key>0))
                {time_key=sys_time;if (--count_key<20){count_key=40;if(++count_key1>4){count_key1=102;count_key=250;}}}
        }
//-------------------------------------------------------------------//
